In [1]:
import pandas as pd
import numpy as np

In [2]:
rng = np.random.RandomState(42)
s1 = pd.Series(rng.rand(5))
s1

0    0.374540
1    0.950714
2    0.731994
3    0.598658
4    0.156019
dtype: float64

In [3]:
s1.max()

0.9507143064099162

In [4]:
s1.sum()

2.811925491708157

In [5]:
sum(s1)

2.811925491708157

In [8]:
max(s1)

0.9507143064099162

In [10]:
df = pd.DataFrame({
    'A': rng.rand(5),
    'B': rng.rand(5)
})
df

          A         B
0  0.183405  0.611853
1  0.304242  0.139494
2  0.524756  0.292145
3  0.431945  0.366362
4  0.291229  0.456070

In [11]:
df.mean()

A    0.347115
B    0.373185
dtype: float64

In [12]:
df.mean(axis='columns')

0    0.397629
1    0.221868
2    0.408451
3    0.399153
4    0.373650
dtype: float64

In [13]:
df.describe()

              A         B
count  5.000000  5.000000
mean   0.347115  0.373185
std    0.132773  0.176818
min    0.183405  0.139494
25%    0.291229  0.292145
50%    0.304242  0.366362
75%    0.431945  0.456070
max    0.524756  0.611853

In [14]:
df = pd.DataFrame({
    'key': list('ABCABC'),
    'data1': range(6),
    'data2': range(5, 11)
})
df

  key  data1  data2
0   A      0      5
1   B      1      6
2   C      2      7
3   A      3      8
4   B      4      9
5   C      5     10

In [15]:
df.groupby('key')

In [16]:
df.groupby('key').sum()

     data1  data2
key
A        3     13
B        5     15
C        7     17

In [17]:
df.groupby('key')['data1'].sum()

key
A    3
B    5
C    7
Name: data1, dtype: int64

In [18]:
df.groupby('key').agg(['sum', 'max'])

    data1     data2
      sum max   sum max
key
A       3   3    13   8
B       5   4    15   9
C       7   5    17  10

In [20]:
df.groupby('key').agg({'data1': np.mean, 'data2': sum})

     data1  data2
key
A      1.5     13
B      2.5     15
C      3.5     17

In [21]:
df.groupby('key').filter(lambda x: x['data1'].std() > 2)

  key  data1  data2
0   A      0      5
1   B      1      6
2   C      2      7
3   A      3      8
4   B      4      9
5   C      5     10

In [23]:
df.groupby('key').transform(lambda x: x - x.mean())

   data1  data2
0   -1.5   -1.5
1   -1.5   -1.5
2   -1.5   -1.5
3    1.5    1.5
4    1.5    1.5
5    1.5    1.5

In [24]:
def norm_by_data2(x):
    x['data1'] /= x['data2'].sum()
    return x

df.groupby('key').apply(norm_by_data2)

  key     data1  data2
0   A  0.000000      5
1   B  0.066667      6
2   C  0.117647      7
3   A  0.230769      8
4   B  0.266667      9
5   C  0.294118     10

In [25]:
cars = pd.read_csv("https://vincentarelbundock.github.io/Rdatasets/csv/DAAG/toycars.csv", index_col=0)
cars.head()

   angle  distance  car
1    1.3      0.43    1
2    1.3      0.37    2
3    1.3      0.27    3
4    4.0      0.84    1
5    4.0      0.92    2

In [29]:
cars.groupby('angle')['distance'].agg(['mean', 'std'])

           mean       std
angle
0.9    0.266667  0.115036
1.1    0.296667  0.130128
1.3    0.356667  0.080829
2.2    0.606667  0.083267
2.7    0.590000  0.045826
3.1    0.640000  0.045826
3.6    0.750000  0.122882
4.0    0.816667  0.116762
4.9    1.083333  0.189297